{"0": {"text": "  \n \n  Class XI Biology   \nwww.vedantu.com    \n1   \n  \n    \n   \nNCERT Solutions for Class 11 Biology  \nChapter 1 – The Living World  \n  \n1. Why are Living Organisms Classified?  \nAns:   \n• \nThe classification of living organisms makes it easier to study the various living \norganisms as they have a huge diversity, making it difficult to study them. The different \nliving organisms are classified into multiple categories based on their common \ncharacteristics.   \n• \nClassification helps scientists and researchers to study them easily and systematically. \nStudying various living organisms will benefit humankind as it will help discover \nmultiple things, including new medicines and the introduction of better-yielding \nvarieties of crops.   \n• \nWith millions of species and various local names, confusion arises. Scientists use a \nstandardised naming system to categorize and identify organisms worldwide to address \nthis.  \n  \n2. Why are the Classification Systems Changing Every Now and Then?  \nAns: The classification systems change according to the need as they arise. There are millions \nof plants, animals, and microorganisms found on earth while several new species have been \nidentified by scientists every now and then.   \nThe world consists of huge numbers of species that are still left to be discovered. As they get \ndiscovered, they consist of new characters so they need to be classified by a new system of "}, "1": {"text": "  \n \n  Class XI Biology   \nwww.vedantu.com    \n2   \n  \n    \nclassification which needs to be prepared based on their characters. Thus, it results in the \nchange in the previous system of classification leading to the formation of the new \nclassification system.    \n   \n3. What Different Criteria Would You Choose To Classify People That You Meet Often?  \nAns: When we meet different people daily in our day-to-day life then we classify and \ncategorize them based on various physical and characteristic features that include their level \nof education, their profession, their native place from where they belong, gender, physical \nfeatures, etc.    \n   \n4. What Do We Learn From the Identification of Individuals and Populations?  \nAns: Following things we learn by identifying individuals and populations:  \n• \nSkin color  \n• \nNative place  \n• \nSex  \n• \nMother tongue  \n• \nCaste   \n• \nReligion   \n• \nFood habit   \n  \n5. Below is the Scientific Name of Mango. Identify the Correctly Written Name.  "}, "2": {"text": "  \n \n  Class XI Biology   \nwww.vedantu.com    \n3   \n  \n    \n1. Mangifera Indica  \n2. Mangifera indica  \nAns: The two names of an individual are called the binomial system of nomenclature, here the \ntwo name includes the generic name which is written first, its first letter must be written in the \ncapital letter while the second name is the specific names whose first letter must be written in \nthe small letter.  Here, the Genus name is Mangifera, and the species name is indica which is \nalways written in lowercase. Thus, the correct way to write the scientific name of Mango is \nMangifera indica.  \n   \n6. Define a Taxon. Give Some Examples of Taxa at Different Hierarchical Levels.  \nAns: A taxon is the classification of the living beings that are arranged on the basis of a \nparticular level of hierarchy. Thus, the basic level of classification can be written as species, \nfollowed by genus, family, order, class, phylum, or division, all these categories are arranged \nin ascending order.  \n   \nThe Following are the hierarchical levels arranged in descending order:  \n• \nKingdom  \n• \nPhylum   \n• \nClass   \n• \nOrder  \n• \nFamily  \n• \nGenus  \n• \nSpecies  "}, "3": {"text": "  \n \n  Class XI Biology   \nwww.vedantu.com    \n4   \n  \n    \n7. Can You Identify the Correct Sequence of Taxonomic Categories?  \n(a) Species → Order → Phylum → Kingdom  \n(b) Genus → Species → Order → Kingdom  \n(c) Species → Genus → Order → Phylum  \nAns: The correct sequence of taxonomic categories can be observed in the case of both (a) and \n(c) as the hierarchy includes Species, Genus, Family, Order, Phylum, and Kingdom that are \narranged in an ascending manner. While in the case of option (b) Species need to be written \nfirst then Genus is to be written since species is the basic unit of classification. Thus, option \n(b) does not show the correct sequence of hierarchy.   \n   \n8. Try To Collect All the Currently Accepted Meanings for the Word Species. Discuss \nWith Your Teacher the Meaning of Species in the Case of Higher Plants and Animals \non One Hand and Bacteria on the Other Hand.  \nAns: Species generally is a biological term that means the basic unit of classification. It is the \ngroup that consists of organisms that are similar in character and can undergo the process of \ninbreeding among themselves even in natural conditions and then result in the formation of \nfertile offspring.  Species are also found to be those organisms that have a similar gene pool \nas well.   \n   \n9. Define and Understand the Following Terms:  \nAns: The definition of the following terms is:  \n(i) \nPhylum: Phylum refers to a taxonomic hierarchy or a taxon with one or more classes of \norganisms with similar characteristics. It comes below Kingdom and above Class  "}, "4": {"text": "  \n \n  Class XI Biology   \nwww.vedantu.com    \n5   \n  \n    \n(ii) \nClass: The class is a group that consists of closely related orders. For example, the class \nMammalia belongs to the orders Primata and Carnivora.  \n(iii) \nFamily: Family is a group of individuals that are closely related genera. For example, \nApes, Monkeys, and Man are related species that belong to the family Hominidae contains \nwhile in the case of plants, based on the vegetative and reproductive features the families are \ncategorized.  \n(iv) \nOrder: Order is composed of an individual that has closely related families. For \nexample, Felidae and Canidae families are closely related and they belong to the order \nCarnivora.  \n(v) \nGenus: Genus includes the group of those species that are closely related to each other. \nGenus has more characteristics in common in comparison to species of other genera. For \nexample, several species like nigrum, melongena, tuberosum, etc come under the genus \nSolanum.  \n   \n10. Why is a Key Helpful in the Identification and Classification of an Organism?  \n• \nAns: The key is also known as the taxonomical strides or taxonomical aid that is used \nfor the classification and identification of the various living organisms that are \nunknown. This will help the researchers to identify the organisms and then classify \nthem.   \n• \nA key is used by beginning with the first couplet and selecting the statement which fits \nthe specimen. It directs the couplet to another couplet which provides the identity of the \nspecimen.   \n• \nFor example, the presence or absence of hair on the body can give a clue if an animal \nbelongs to mammals or not. Separate taxonomic keys are required for each taxonomic \ncategory such as family, genus, and species for the purpose of identification. There are \nthree types of keys which are dichotomous, polyclave, and probability.  \n   "}, "5": {"text": "  \n \n  Class XI Biology   \nwww.vedantu.com    \n6   \n  \n    \n11. Illustrate the Taxonomic Hierarchy With Suitable Examples of a Plant and an \nAnimal.  \n Ans: \nTaxonomic Categories  Classification of a Plant: Mango  Classification Animal: \nHuman  \nof  \nKingdom  \nPlantae  \nAnimalia  \nPhylum/Division  \nAngiospermae  \nChordata  \nClass  \nDicotyledonae  \nMammalia  \nOrder  \nSapindales  \nPrimata  \nFamily  \nAnacardiaceae  \nHominidae  \nGenus  \nMangifera  \nHomo  \nSpecies  \nIndica  \nSapiens  \n  \n  \n"}}