{"0": {"text": "ELECTROSTATICS \n1. \nA thin plastic rod is bent into a circular ring of radius R. It is uniformly charged with charge density λ. The \nmagnitude of the electric field at its centre is: \n(A) \nλ\n2ε0R\n(B) Zero\n(C) \nλ\n4πε0R\n (D) \nλ\n4ε0R\nAns. (B) Zero\n2. \nTen capacitors, each of capacitance 1 µF, are connected in parallel to a source of 100 V. The total energy stored \nin the system is equal to:  \n(A) 10-2 J\n(B) 10-3 J\n(C) 0.5×10-3 J\n(D) 5.0×10-2 J\nAns. (D) 5.0×10-2 J\n3. \nTwo charged particles P and Q, having the same charge but different masses mP and mQ, start from rest and \ntravel equal distances in a uniform electric field E in time tP and tQ respectively. Neglecting the effect of gravity, \nthe ratio (\n tp\ntq) is: \n(A) \n mp\nmq\n     (B) \n mq\nmp\n(C) √\n mp\nmq\n(D) √\n mq\nmp\nAns. (C) √\n mp\nmq\n4. \nConsider a group of charges q1, q2 , q3… such that ∑q ≠0. Then equipotentials at a large distance, due to this \ngroup are approximately : \n(A) Plane\n(B) Spherical surface\n(C) Paraboloidal surface\n(D) Ellipsoidal surface\nAns. (B) Spherical surface\n5. \nA proton is taken from point P1 to point P2, both located in an electric field. The potentials at points P1 and P2 \nare -5 V and +5 V respectively. Assuming that kinetic energies of the proton at points P1 and P2 are zero, the \nwork done on the proton is: \n(A) -1.6 × 10-18 J\n(B) 1.6 × 10-18 J\n(C) Zero\n(D) 0·8 × 10-18 J\nAns. (B) 1.6 ×10-18 J\n6. \nTwo charges +q each are kept ‘2a’ distance apart. A third charge -2q is placed midway between them. The \npotential energy of the system is- \n(A) \nq2\n8πε0a\n(B) −\n6q2\n8πε0a\n(C) −\n7q2\n8πε0a\n     (D) \n9q2\n8πε0a\nAns. (C) −\n7q2\n8πε0a\n7. \nTwo identical small conducting balls B1 and B2 are given -7 pC and +4 pC charges respectively. They are \nbrought in contact with a third identical ball B3 and then separated. If the final charge on each ball is -2 pC, \nthe initial charge on B3 was \n(A) -2 pC\n(B) -3 pC\n(C) -5 pC\n(D) -15 pC\nAns. (B) -3 pC\n8. \nA point charge situated at a distance ‘r’ from a short electric dipole on its axis, experiences a force F. If the \ndistance of the charge is ‘2r’, the force on the charge will be: \n(A) \nF\n16\n   (B) \nF\n8\n(C) \nF\n4\n(D) \nF\n2\nAns. (B) \nF\n8\n9. \nIn the process of charging of a capacitor, the current produced between the plates of the capacitor is: \nwhere symbols have their usual meanings. \nAns. "}, "1": {"text": "10. \nThe magnitude of the electric field due to a point charge object at a distance of 4.0 m is 9 N/C. From the same \ncharged object the electric field of magnitude, 16 N/C will be at a distance of \n(a) 1 m\n(b) 2 m\n(c) 3 m\n(d) 6 m\nAns. (c) 3 m\n11. \nA point P lies at a distance x from the mid point of an electric dipole on its axis. The electric potential at point \nP is proportional to \n(A) \n1\nx2\n     (B) \n1\nx3\n(C) \n1\nx4\n(D) \n1\nx1/2\nAns. (A) \n1\nx2\n12. \nAns. \n13. \nWhich one of the following is not a scalar quantity? \n(a) Electric field\n(b) Voltage\n(c) Resistivity\n(d) Power\nAns. (a) Electric field\n14. \nTwo charges q1 and q2 are placed at the centres of two spherical conducting shells of radius r₁ and r2 \nrespectively. The shells are arranged such that their centres are d [ > (r1 + r₂)] distance apart. The force on q2 \ndue to q1 is : \nAns. (c) Zero\n15. \nAn electric dipole of length 2 cm is placed at an angle of 30° with an electric field 2 x 105 N/C. If the dipole \nexperiences a torque of 8 × 10-3 Nm, the magnitude of either charge of the dipole, is  \n(А) 4 µC                                     (В) 7 µС                                          (C) 8 mC                                    (D) 2 mC \nAns. (А) 4 µC \n16. \nTwo long parallel wires kept 2 m apart carry 3A current each, in the same direction. The force per unit length \non one wire due to the other is  \n(A) 4.5 x 10-5 Nm-1, attractive\n(B) 4.5 x 10-7 N/m, repulsive\n(C) 9 x 10-7 N/m, repulsive\n(D) 9 x 10-5 N/m, attractive\nAns. No option is correct. [Award one mark to each student] \nAccording to Marking scheme \n17. \nThe capacitors, each of 4 µF are to be connected in such a way that the effective capacitance of the combination \nis 6 µF. This can be achieved by connecting \n(A) All three in parallel\n(B) All three in series\n(C) Two of them connected in series and the combination in parallel to the third.\n(D) Two of them connected in parallel and the combination in series to the third.\nAns. (C) Two of them connected in series and the combination in parallel to the third.\nCURRENT ELECTRICITY \n1. \nConsider the circuit shown in the figure. The potential difference between points A and B is: \n(A) 6 V (B) 8 V (C) 9 V (D) 12 V\nAns. (B) 8 V"}, "2": {"text": "2. \nElectrons drift with speed Vd in a conductor with potential difference V across its ends. If V is reduced to \n(\n V\n2), their drift speed will become: \n(A) \nVd\n2\n(B) Vd\n(C) 2 Vd\n(D) 4 Vd\nAns. (A) \nVd\n2\n3. \nA battery supplies 0.9 A current through a 2 Ω resistor and 0.3 A current through a 7 Ω resistor when connected \none by one. The internal resistance of the battery is: \n(A) 2 Ω\n(B) 1.2 Ω\n(C) 1 Ω\n(D) 0.5 Ω\nAns. (D) 0.5 Ω\n4. \nFor a metallic conductor, the correct representation of variation of resistance R with temperature T is : \nAns. \n5. \nThe potential difference across a cell in an open circuit is 8 V. It falls to 4 V when a current of 4 A is drawn \nfrom it. The internal resistance of the cell is: \n(a) 4 Ω\n(b) 3Ω\n(c) 2Ω\n(d) 1Ω\nAns. (d) 1Ω\n6. \nA steady current flows through a metallic wire whose area of cross-section (A) increases continuously from \none end of the wire to the other. The magnitude of drift velocity (Vd) of the free electrons as a function of 'A' \ncan be shown by: \nAns. \n7. \nA current of 0.8 A flows in a conductor of 40Ω for 1 minute. The heat produced in the conductor will be \n(a) 1445 J\n(b) 1536 J\n(c) 1569 J\n(d) 1640 J\nAns. (b) 1536 J\n8. \nA cell of emf E is connected across an external resistance R. When current 'I' is drawn from the cell, the \npotential difference across the electrodes of the cell drops to V. The internal resistance 'r' of the cell is \n(A) (\nE−V\nE ) R \n(B) (\nE−V\nR ) \n(C) \n(E−V)R\nI\n(D) (\nE−V\nV ) R \nAns. (D) (\nE−V\nV ) R \n9. \nThe current density due to drift of electrons in a conductor is given by : (symbols have their usual meanings) "}, "3": {"text": "(a) ne AVd (b) \nnAVd\ne  (c) \nnVd\neA (d) ne Vd\nAns. (d) ne Vd\nMOVING CHARGES AND MAGNETISM \n1. \nA loop carrying a current I clockwise is placed in x-y plane, in a uniform magnetic field directed along z-axis. \nThe tendency of the loop will be to: \n(A) move along x-axis\n(B) move along y-axis\n(C) shrink\n(D) expand\nAns. (C) shrink\n2. \nA 10 cm long wire lies along y-axis. It carries a current of 1.0 A in positive y-direction. A magnetic field B⃗⃗ = \n (5 mT) ĵ - (8 mT) K̂  exists in the region. The force on the wire is: \n(A) (0·8 mN) î\n(B) - (0·8 mN) î\n(C) (80 mN) î\n(D) - (80 mN) î\nAns. (B) - (0·8 mN) î\n3. \nA galvanometer of resistance G Ω is converted into an ammeter of range 0 to I A. If the current through the \ngalvanometer is 0.1% of I A, the resistance of the ammeter is: \n(A) \nG\n999 Ω \n(B) \nG\n1000 Ω \n (C) \nG\n1001 Ω \n (D) \nG\n100.1 Ω \nAns. (B) \nG\n1000 Ω \n4. \nA wire of length 4.4 m is bent round in the shape of a circular loop and carries a current of 1.0 A. The magnetic \nmoment of the loop will be: \n(A) 0.7 Am2\n(B) 1.54 Am2\n(C) 2.10 Am2\n(D) 3.5 Am2\nAns. (B) 1.54 Am2\n5. \nA circular coil of radius 10 cm is placed in a magnetic field B = (1·0 ^i + 0·5 ^j ) mT such that the outward \nunit vector normal to the surface of the coil is (0·6 ^i + 0·8 ^j ). The magnetic flux linked with the coil is : \n(A) 0.314 µWb\n(B) 3.14 µWb\n(C) 31.4 µWb\n(D) 1.256 µWb\nAns. (C) 31.4 µWb\n6. \nA 2.0 cm segment of wire, carrying 5.0 A current in positive y-direction lies along y-axis, as shown in the \nfigure. The magnetic field at a point (3 m, 4 m, 0) due to this segment (part of a circuit) is : \nAns. (C) – (0.24 nT) ^k\n7. \nA circular loop of wire, carrying a current ‘I’ is lying in xy-plane with its centre coinciding with the origin. It \nis subjected to a uniform magnetic field pointing along + z-axis. The loop will : \n(A) move along x-axis\n(B) move along -y-axis\n(C) move along z-axis\n(D) remain stationary\nAns. (D) remain stationary\n8. \nA current carrying circular loop of magnetic moment M is suspended in a vertical plane in an external magnetic \nfield B such that its plane is normal to B. The work done in rotating this loop by 450 about an axis perpendicular \nto B is closest to : \n(A) -0.3 MB\n(B) 0.3 MB\n(C) -1.7 MB\n(D) 1.7 MB\nAns. (B) 0.3 MB\n9. \nA straight wire is kept horizontally along east-west direction. If a steady current flows in wire from east to \nwest, the magnetic field at a point above the wire will point towards \n(A) East\n(B) West\n(C) North\n(D) South\nAns. (C) North\n10. \nThe magnetic susceptibility for a diamagnetic material is \n(A) small and negative (B) small and positive (C) large and negative (D) large and positive"}, "4": {"text": "Ans. (A) small and negative\n11. \nA galvanometer of resistance 100 Ω is converted into an ammeter of range (0-1 A) using a resistance of 0.1 Ω. \nThe ammeter will show full scale deflection for a current of about \n(A) 0.1 mA\n(B) 1 mA\n(C) 10 mA\n(D) 0.1 mA\nAns. (B) 1 mA\n12. \nA circular loop A of radius R carries a current I. Another circular loop B of radius r = \nR\n20 is placed concentrically \nin the plane of A. The magnetic flux linked with loop B is proportional to \n(A) R\n(B) √R\n(C) R3/2\n(D) R2\nAns. (B) √R\n13. \nA particle of mass m and charge q describes a circular path of radius R in a magnetic field. If it mass and \ncharge were 2m and \nq\n2 respectively, the radius of its path would be \n(A) \nR\n4\n      (B) \nR\n2\n(C) 2R\n(D) 4R\nAns. (D) 4R\n14. \nWhich of the following pairs is that of paramagnetic materials ? \nAns. (A) Copper and Aluminium\n(B) Sodium and Calcium\n(C) Lead and Iron\n(D) Nickel and Cobalt\n15. \nA galvanometer of resistance 50 Ω is converted into a voltmeter of range (0-2 V) using a resistor of 1.0 k Ω. \nIf it is to be converted into a voltmeter of range (0-10 V), the resistance required will be \n(A) 4.8 k Ω\n(B) 5.0 k Ω\n(C) 5.2 k Ω\n(D) 5.4 k Ω\nAns. (C) 5.2 k Ω\n16. \nA diamagnetic substance is brought near the north or south pole of a bar magnet. It will be : \n(a) repelled by both the poles.\n(b) attracted by both the poles.\n(c) repelled by the north pole and attracted by the south pole.\n(d) attracted by the north pole and repelled by the south pole.\nAns. (a) repelled by both the poles.\n17. \nBeams of electrons and protons move parallel to each other in the same direction. They \n(a) attract each other.\n(b) repel each other.\n(c) neither attract nor repel.\n(d) force of attraction or repulsion depends upon speed of beams.\nAns. (b) repel each other.\n18. \nA long straight wire of radius 'a' carries a steady current ‘I’. The current is uniformly distributed across its area \nof cross-section. The ratio of magnitude of magnetic field B1 at a/2 and B₂ at distance 2a is \n(a) 1/2\n(b) 1\n(d) 4\nAns. (b) 1\n19. \nWhich of the following graphs correctly represents the variation of the magnitude of the magnetic field outside \na straight infinite current carrying wire of radius 'a', as a function of distance 'r' from the centre of the wire ? \nAns. \n20."}, "5": {"text": "(a) a circle in x-z plane\n(b) a parabola in x-y plane\n(c) a helix with constant pitch\n(d) a helix with increasing pitch\nAns. (d) a helix with increasing pitch\n21. \nAn electron enters a uniform magnetic field with speed v. It describes a semicircular path and comes out of \nthe field. The final speed of the electron is :  \n(a) Zero\n(b) v\n(c) v/2\n(d) 2v\nAns. (b) v\n22. \nThe magnetic field lines near a substance are as shown in the figure. The substance is : \n(a) Copper\n(b) Iron\n(c) Sodium\n(d) Aluminium\nAns. (a) Copper\n23. \nWhich of the following has its permeability less than that of free space? \n(A) Copper\n(B) Aluminium\n(C) Copper chloride\n(D) Nickel\nAns. (A) Copper\n24. \nA square shaped coil of side 10 cm, having 100 turns is placed perpendicular to a magnetic field which is \nincreasing at 1 T/s. The induced emf in the coil is  \n(A) 0.1 V\n(B) 0.5 V\n(C) 0.75 V\n(D) 1.0 V\nAns. (D) 1.0 V\nELECTROMAGNETIC INDUCTION \n1. \nWhich of the following quantity/quantities remains same in primary and secondary coils of an ideal \ntransformer ? Current, Voltage, Power, Magnetic flux \n(A) Current only\n(B) Voltage only\n(C) Power only\n(D) Magnetic flux and Power both\nAns. (D) Magnetic flux and Power both \n2. \nThe current in a coil of 15 mH increases uniformly from zero to 4 A in 0.004 s. The emf induced in the coil \nwill be : \n(A) 22.5 V\n(B) 17.5 V\n(C) 15.0 V\n(D) 12.5 V\nAns. (C) 15.0 V\n3. \nConsider a solenoid of length l and area of cross-section A with fixed number of turns. The self-inductance of \nthe solenoid will increase if:  \n(A) both l and A are increased\n(B) l is decreased and A is increased\n(C) l is increased and A is decreased\n(D) both l and A are decreased\nAns. (B) l is decreased and A is increased\n4. \nA coil of N turns is placed in a magnetic field B such that B is perpendicular to the plane of the coil. B changes \nwith time as B = B0 cos (\n2π\nT t) where T is time period. The magnitude of emf induced in the coil will be\nmaximum at \n(A) t =\nnT\n8\n(B) t =\nnT\n4\n(C) t =\nnT\n2\n(D) t = nT\nHere, n = 1, 2, 3, 4, …\nAns. (B) t =\nnT\n4\n5. \nTwo coils are placed near each other. When the current in one coil is changed at the rate of 5 A/s, an emf of 2 \nmV is induced in the other. The mutual inductance of the two coils is \n(A) 0.4 mH\n(B) 2.5 mH\n(C) 10 mH\n(D) 2.5 H\nAns. (A) 0.4 mH\n6. \nA circular coil of radius 8.0 cm and 40 turns is rotated about its vertical 25 diameter with an angular speed of \n25\nπ  rad s-1 in a uniform horizontal π magnetic field of magnitude 3.0 × 10-2 T. The maximum emf induced in \nthe coil is : \n(a) 0.12 V\n(b) 0.15 V\n(c) 0.19 V\n(d) 0.22 V\nAns. (c) 0.19 V\n7. \nFigure shows a rectangular conductor PSRQ in which movable arm PQ has a resistance 'r' and resistance of \nPSRQ is negligible. The magnitude of emf induced when PQ is moved with a velocity V does not depend on: "}, "6": {"text": "Ans. (c) resistance (r)\n8. \nThe direction of induced current in the loop abc is : \n(a) along abc if I decreases\n(b) along acb if I increases\n(c) along abc if I is constant\n(d) along abc if I increases\nAns. (d) along abc if I increases\nALTERNATING CURRENT \n1. \nThe reactance of a capacitor of capacitance C connected to an ac source of frequency 𝛚 is ‘X’. If the \ncapacitance of the capacitor is doubled and the frequency of the source is tripled, the reactance will become: \n(a) \n𝐗\n𝟔\n(b) 6X\n     (c) \n𝟐\n𝟑𝐗 \n (d) \n𝟑\n𝟐𝐗 \nAns. (a) \nX\n6\n2. \nA resistor and an ideal inductor are connected in series to a 100√2 V, 50 Hz ac source. When a voltmeter is \nconnected across the resistor or the inductor, it shows the same reading. The reading of the voltmeter is : \n(A) 100√2 V\n(B) 100 V\n(C) 50√2 V\n(D) 50 V\nAns. (B) 100 V\n3. \nFigure shows the variation of inductive reactance XL of two ideal inductors L1 and L2, with angular frequency \nω. The value of\nL1\nL2 is \nAns. (D) \n1\n3\n4. \nAn inductor, a capacitor and a resistor are connected in series across an ac source of voltage. If the frequency \nof the source is decreased gradually, the reactance of:  \n(a) both the inductor and the capacitor decreases.\n(b) inductor decreases and the capacitor increases.\n(c) both the inductor and the capacitor increases.\n(d) inductor increases and the capacitor decreases.\nAns. (b) inductor decreases and the capacitor increases.\n5. \nThe figure shows variation of current (I) with time (t) in four devices P, Q, R and S. The device in which an \nalternating current flows is : "}, "7": {"text": "(a) P\n(b) Q\n(c) R\n(d) S\nAns. (d) S\n6. \nAn ac voltage v = vo sin ωt is applied to a series combination of a resistor R and an element X. The \ninstantaneous current in the circuit is I = I0 sin (ωt + \nπ\n4). Then, which of the following is correct ?\n(a) X is a capacitor and Xc = √2 R\n(b) X is an inductor and XL = R\n(c) X is an inductor and XL = √2 R\n(d) X is a capacitor and Xc = R\nAns. (d) X is a capacitor and Xc = R\n7. \nWhich of the following statements about a series LCR circuit connected to an ac source is correct? \n(A) If the frequency of the source is increased, the impedance of the circuit first decreases and then increases.\n(B) If the net reactance (XL - XC) of circuit becomes equal to its resistance, then the current leads the voltage\nby 45°.\n(C) At resonance, the voltage drop across the inductor is more than that across the capacitor.\n(D) At resonance, the voltage drop across the capacitor is more than that across the inductor.\nAns. (A) If the frequency of the source is increased, the impedance of the circuit first decreases and then increases.\nELECTROMAGNETIC WAVES \n1. \nIn the four regions, I, II, III and IV, the electric fields are described as: \nRegion I   : Ex = E0 sin (kz-ωt)  \nRegion II  : Ex = E0  \nRegion III : Ex = E0 sin kz  \nRegion IV : Ex = E0 cos kz  \nThe displacement current will exist in the region:  \n(A) I\n(B) IV\n(C) II\n(D) III\nAns. (A) I\n2. \nElectromagnetic waves with wavelength 10 nm are called : \n(A) Infrared waves\n(B) Ultraviolet rays\n(C) Gamma rays\n(D) X-rays\nAns. (B) Ultraviolet rays\n3. \nWhich one of the following has the highest frequency ? \n(A) Infrared rays\n(B) Gamma rays\n(C) Radio waves\n(D) Microwaves\nAns. (B) Gamma rays\n4. \nThe phase difference between electric field E and magnetic field B in an electromagnetic wave propagating \nalong z-axis is- \n(A) Zero\n(B) π\n         (C) \nπ\n2\n(D) \nπ\n4\nAns. (A) Zero\n5. \nThe electromagnetic waves used to purify water are \n(A) Infrared rays\n(B) Ultraviolet rays\n(C) X-rays\n(D) Gamma rays\nAns. (B) Ultraviolet rays\n6. \nE and B represent the electric and the magnetic field of an electromagnetic wave respectively. The direction \nof propagation of the wave is along  \n(a) B\n(b) E\n(c) E×B\n(d) B×E\nAns. (c) E×B\n7. \nThe electromagnetic radiations used to kill germs in water purifiers are called: \n(a) Infrared waves\n(b) X-rays\n(c) Gamma rays\n(d) Ultraviolet rays\nAns. (d) Ultraviolet rays\n8. \nThe electromagnetic waves used in radar systems are : \n(a) Infrared waves\n(b) Ultraviolet rays\n(c) Microwaves\n(d) X-rays\nAns. (c) Microwaves"}, "8": {"text": "9. \nWhich one of the following electromagnetic radiation has the least wavelength ? \n(A) Gamma rays\n(B) Microwaves\n(C) Visible light\n(D) X-rays\nAns. (A) Gamma rays"}, "9": {"text": "RAY OPTICS AND WAVE OPTICS \n1. \nThe focal lengths of the objective and the \neyepiece of a compound microscope are 1 cm \nand 2 cm respectively. If the tube length of the \nmicroscope is 10 cm, the magnification obtained \nby the microscope for most suitable viewing by \nrelaxed eye is: \n(A) 250\n(B) 200\n(C) 150\n(D) 125\n7. \nA Young’s double-slit experiment set up is kept \nin a medium of refractive index (4/3). Which \nmaximum in this case will coincide with the 6th \nmaximum obtained if the medium is replaced \nby air? \n(A) 4th\n(B) 6th\n(C) 8th\n(D) 10th\n2. \nFor a concave mirror of focal length ‘f’, the \nminimum distance between the object and its \nreal image is: \n(A) zero\n(B) f\n(C) 2f\n(D) 4f\n8. \nA ray of monochromatic light propagating in \nair, is incident on the surface of water. Which of \nthe following will be the same for the reflected \nand refracted rays? \n(A) Energy carried\n(B) speed\n(C) Frequency\n(D) wavelength\n3. \nA beam of light travels from air into a medium. \nIts speed and wavelength in the medium are  \n1.5 × 108 m/s and 230 nm respectively. The \nwavelength of light in air will be \n(A) 230 nm\n(B) 345 nm\n(C) 460 nm\n(D) 690 nm\n9. \nIn the wave picture of light, the intensity I of \nlight is related to the amplitude A of the wave \nas: \n(A) I α √A\n(B) I α A\n(C) I α A2\n(D) I α 1/A2\n4. \nIn a single-slit diffraction experiment, the width \nof the slit is halved. The width of the central \nmaximum, in the diffraction pattern, will \nbecome: \n(A) half\n(B) twice\n(C) four times\n(D) one-fourth\n10. \nIn a Young’s slit experiment, the fringe width is \nfound to be β. If the entire apparatus is \nimmersed in a liquid of refractive index μ, the \nnew fringe width will be: \n(A) β\n(B) μβ \n(C) β/μ \n (D) β/μ2 \n5. \nAccording to Huygen’s principle, the amplitude \nof secondary wavelets is \n(A) equal in both the forward and the\nbackward directions.\n(B) Maximum in the forward direction and\nzero in the backward direction.\n(C) Large in the forward direction and small in\nthe backward direction.\n(D) Small in the forward direction and large in\nthe backward direction.\n11. \nIn a Young’s double-slit experiment, the screen \nis moved away from the plane of the slits. What \nwill be its effect on the following? \n(i) Angular separation of the fringes.\n(ii) Fringe-width.\n(A) Both (i) and (ii) remain constant\n(B) (i) remains constant, but (ii) decreases\n(C) (i) remains constant, but (ii) increases\n(D) Both (i) and (ii) increase.\n6. \nA plane wavefront is incident on a concave \nmirror of radius of curvature R. The radius of \nthe refracted wavefront will be: \n(A) 2R\n(B) R\n(C) R/2\n(D) R/4"}, "10": {"text": "SEMICONDUCTOR \n1. \nGe is doped with As. Due to doping, \n(A) the structure of Ge lattice is distorted.\n(B) the number of conduction electrons increases.\n(C) the number of holes increases.\n(D) the number of conduction electrons decreases.\n8. \nAn n-type semiconducting Si is obtained by \ndoping intrinsic Si with:  \n(A) Al\n(B) B\n(C) P\n(D) In\n2. \nWhen a p-n junction diode is subjected to \nreverse biasing: \n(A) the barrier height decreases and the depletion\nregion widens.\n(B) the barrier height increases and the depletion\nregion widens.\n(C) the barrier height decreases and the depletion\nregion shrinks.\n(D) the barrier height increases and the depletion\nregion shrinks.\n9. \nThe threshold voltage for a p-n junction diode \nused in the circuit is 0.7 V. The type of biasing \nand current in the circuit are: \n(A) Forward biasing, 0 A\n(B) Reverse biasing, 0 A\n(C) Forward biasing, 5 mA\n(D) Reverse biasing, 2 mA\n3. \nWhen an intrinsic semiconductor is doped with \na small amount of trivalent impurity, then: \n(A) its resistance increases.\n(B) it becomes a p-type semiconductor.\n(C) there will be more free electrons than holes in\nthe semiconductor.\n(D) dopant atoms become donor atoms.\n10. \nSi is doped with a pentavalent element. The \nenergy required to set the additional electron \nfree is about:  \n(A) 0·01 eV\n(B) 0·05 eV\n(C) 0·72 eV\n(D) 1·1 eV\n4. \nIn the energy-band diagram of n-type Si, the \ngap between the bottom of the conduction band \nEC and the donor energy level ED is of the order \nof: \n(A) 10 eV\n(B) 1 eV\n(C) 0.1 eV\n(D) 0.01 eV\n11. \nIn an extrinsic semiconductor, the number \ndensity of holes is 4 × 1020 m-3. If the number of \ndensity of intrinsic carriers is 4 × 1020 m-3, the \nnumber density of electrons in it is \n(A) 1.8 × 109 m-3\n(B) 2.4 × 1010 m-3 \n(C) 3.6 × 109 m-3 \n(D) 3.2 × 1010 m-3\n5. \nA pure Si crystal having 5 × 1028 atoms m-3 is \ndoped with 1 ppm concentration of antimony. If \nthe concentration of holes in the doped crystal is \nfound to be 4.5 × 109 m-3, the concentration (in \nm-3) of intrinsic charge carriers in Si crystal is\nabout\n(A) 1.2 × 1015\n(B) 1.5 × 1016\n(C) 3.0 × 1015 \n(D) 2.0 × 1016\n12. \nAt a certain temperature in an intrinsic \nsemiconductor, \nthe \nelectrons \nand \nholes \nconcentration is 1.5 × 1016 m-3. When it is doped \nwith a trivalent dopant, hole concentration \nincreases to 4.5 × 1022 m-3. In the doped \nsemiconductor, the concentration of electrons \n(ne) will be: \n(A) 3 × 106 m-3 \n(B) 5 × 107 m-3 \n(C) 5 × 109 m-3\n(D) 6.75 × 1038 m-3\n6. \nIf a p-n junction diode is reverse biased, \n(A) the potential barrier is lowered.\n(B) the potential barrier remains unaffected.\n(C) the potential barrier is raised\n(D) the current is mainly due to majority carriers.\n13. \nThe formation of depletion region in a p-n \njunction diode is due to \n(A) movement of dopant atoms\n(B) diffusion of both electrons and holes\n(C) drift of electrons only\n(D) drift of holes only\n7. \nDuring the formation of a p-n junction: \n(A) diffusion currents keep increasing\n(B) drift current remains constant\n(C) both the diffusion current and drift current\nremain constant.\n(D) diffusion current remains almost constant but\ndrift current increases till both currents become\nequal.\n14. \nAn ac source of voltage is connected in series with a \np-n junction diode and a load resistor. The correct\noption for output voltage across load resistance will\nbe:"}, "11": {"text": "MODERN PHYSICS \n( DUAL NATURE OF RADIATION AND MATTER, ATOMS AND NUCLEI ) \n1. \nThe transition of electron that gives rise to the \nformation of the second spectral line of the \nBalmer series in the spectrum of hydrogen atom \ncorresponds to:\n(A) nf = 2 and ni = 3\n(B) nf = 3 and ni = 4\n(C) nf = 2 and ni = 4\n(D) nf = 2 and ni = ∞\n6. \nTwo beams, A and B whose photon energies are 3·3 \neV and 11·3 eV respectively, illuminate a metallic \nsurface (work function 2·3 eV) successively. The \nratio of maximum speed of electrons emitted due \nto beam A to that due to beam B is:\n(A) 3\n(B) 9\n(C) \n𝟏\n𝟑\n   (D) \n𝟏\n𝟗\n2. \nA proton and an alpha particle having equal \nvelocities approach a target nucleus. They come \nmomentarily to rest and then reverse their \ndirections. The ratio of the distance of closest \napproach of the proton to that of the alpha \nparticle will be: \n(A) \n𝟏\n𝟐\n(B) 2\n(C) \n𝟏\n𝟒\n(D) 4\n7.\nEnergy levels A, B and C of an atom correspond to \nincreasing values of energy i.e. EA < EB < EC. Let 1, \n2 and 3 be the wavelengths of radiation \ncorresponding to the transitions C to B, B to A and \nC to A, respectively. The correct relation between \nλ1 λ2 and λ3 is: \n(A) λ12 + λ22 = λ32\n       (B) \n1\nλ1 + \n1\nλ2 = \n1\nλ3\n(C) λ1 + λ2 + λ3 = 0\n(D) λ1 + λ2 = λ3\n3. \nAn alpha particle approaches a gold nucleus in \nGeiger-Marsden experiment with kinetic energy \nK. It momentarily stops at a distance d from the\nnucleus and reverses its direction. Then d is\nproportional to:\n(A) \n1\n√K\n(B) √K\n(C) \n1\nK\n(D) K\n8.\nThe work function for a photosensitive surface is \n3·315 \neV. \nThe \ncut-off \nwavelength \nfor \nphotoemission of electrons from this surface is: \n(A) 150 nm\n(B) 200 nm\n(C) 375 nm\n(D) 500 nm\n4. \nWhich one of the following is the correct graph \nbetween the maximum kinetic energy (Km) of \nthe emitted photoelectrons and the frequency of \nincident radiation (v) for a given photosensitive \nsurface? \n9. \nThe variation of the stopping potential (V0) with \nthe frequency (v) of the incident radiation for four \nmetals A, B, C and D is shown in the figure. For the \nsame frequency of incident radiation producing \nphotoelectrons in all metals, the kinetic energy of \nphotoelectrons will be maximum for metal \n(A) A\n(B) B\n(C) C\n(D) D\n5. \nAn electron makes a transition from n = 2 level \nto n = 1 level in the Bohr model of a hydrogen \natom. Its period of revolution:  \n(A) increases by 87.5%\n(B) decreases by 87.5%\n(C) increases by 43.75%\n(D) decreases by 43.75%\n10. The radius (rn) of nth orbit in Bohr model of \nhydrogen atom varies with n as \n(a) rn α n\n(b) rn α \n1\n𝑛\n(c) rn α n2\n(d) rn α \n1\nn2"}, "12": {"text": "11.\nIn Balmer series of Hydrogen atom, as the \nwavelength of spectral decreases, they appear\n(A) equally spaced and equally intense.\n(B) further apart and stronger in intensity.\n(C) closer together and stronger in intensity.\n(D) closer together and weaker in intensity.\n18. The energy of an electron in the ground state of \nhydrogen atom is -13.6 eV. The kinetic and \npotential energy of the electron in the first excited \nstate will be\n(A) -13.6 eV, 27.2 eV\n(B) -6.8 eV, 13.6 eV\n(C) 3.4 eV, -6.8 eV\n(D) 6.8 eV, -3.4 eV\n12.\nThe radius of the nth orbit in Bohr Model of \nhydroegn atom is proportional to:\n(A) \n1\nn2\n(B) \n1\n𝑛\n(C) n2\n(D) n\n19. The potential energy between to nucleons inside a \nnucleus is minimum at a distance of about\n(A) 0.6 fm\n(B) 1.6 fm\n(C) 2.0 fm\n(D) 2.8 fm\n  13.\nThe quantum nature of light explains the \nobservations on Photoelectric effect as-\nere is a minimum frequency of incident radiation\nlow which no electrons are emitted.\ne maximum kinetic energy of photoelectrons depend\nly on the frequency of incident radiation.\nhen the metal surface is illuminated, electrons are\ncted from the surface after sometime.\ne photoelectric current is independent of the intensity\nincident radiation.\n20. The diagram shows four energy level of an electron \nin Bohr model of hydrogen atom. Identity the \ntransition in which the emitted photon will have \nthe highest energy.\n(A) I\n(B) II\n(C) III\n(D) IV\n14.\nThe mass density of a nucleus of mass number A \nis:\n(A) proportional to A1/3\n(B) proportional to A2/3\n(C) proportional to A3\n(D) independent of A\n21. A hydrogen atom makes a transition from n = 5 to \nn = 1 orbit. The wavelength of photon emitted is λ. \nThe wavelength of photon emitted when it makes \na transition from n = 5 to n = 2 orbit is\n(A) \n8\n7 λ\n   (B) \n16\n7  λ\n(C) \n24\n7  λ \n(D) \n32\n7  λ \n15.\nThe curve of binding energy per nucleon as a \nfunction of atomic mass number has a sharp \npeak for helium nucleus. This implies that \nhelium nucleus is\n(A) radioactive\n(B) unstable\n(C) easily fissionable\n(D) more stable nucleus than its neighbours\n22. A graph is plotted between the stopping potential \n(on y-axis) and the frequency of incident radiation \n(on x-axis) for a metal. The product of the slope of \nthe straight line obtained and the magnitude of \ncharge on an electron is equal to:\n(A) h\n(B) \nh\nc\n(C) \n2h\nc\n(D) \nh\n2c\n16.\nLight of frequency 6.4 × 1014 Hz is incident on a \nmetal of work function 2.14 eV. The maximum \nkinetic energy of the emitted electrons is about:\n(A) 0.25 eV\n(B) 0.51 eV\n(C) 1.02 eV\n(D) 0.10 eV\n23. The ratio of maximum frequency and minimum \nfrequency of light emitted in Balmer series pf \nhydrogen spectrum, in Bohr’s model is:\n(A) \n11\n9\n(B) \n9\n5\n(C) \n11\n7\n(D) \n16\n7\n17.\nPhotons of energy 3.2 eV are incident on a \nphotosensitive surface. If the stopping potential \nfor the emitted electrons is 1.5 V, the work \nfunction for the surface is:\n(A) 1.5 eV\n(B) 1.7 eV\n(C) 3.2 eV\n(D) 4.7 eV\n24. A proton and an alpha particle have the same \nkinetic energy. The ratio of de Broglie wavelengths \nassociated with the proton to that with the alpha \nparticle is:\n(A) 1\n(B) 2\n(C) 2√2\n(D) ½"}, "13": {"text": "25. \nThe potential energy of an electron in the second \nexcited state in hydrogen atom is: \n(A) -3.4 eV\n(B) -3.02 eV\n(C) -1.51 eV\n(D) -6.8 eV\n29. The difference in mass of 7X nucleus and total mass \nof its constituent nucleons is 21.00 u. The binding \nenergy per nucleon for this nucleus is equal to the \nenergy equivalent of: \n(A) 3 u\n(B) 3.5 u\n(C) 7 u\n(D) 21 u\n26. \nThe energy of a photon of wavelength λ is \n(A) hc λ\n(B) hc/ λ\n(C) λ/hc\n(D) λh/c\n30. The ratio of the nuclear densities of two nuclei \nhaving mass number 64 and 125 is \n(A) \n64\n125\n         (B) \n4\n5\n(C) \n5\n4\n(D) 1\n27. \nHydrogen atom initially in the ground state, \nabsorbs a photon which excites it to n = 5 level. \nThe wavelength of the photon is: \n(A) 975 nm\n(B) 740 nm\n(C) 523 nm\n(D) 95 nm\n31. \n28. \nThe waves associated with a moving electron and \na moving proton have the same wavelength λ. It \nimplies that they have the same: \n(A) momentum\n(B) angular momentum\n(C) speed\n(D) energy\n32. Which one of the following metals does not exhibit \nemission of electrons from its surface when \nirradiated by visible light? \n(A) Rubidium\n(B) Sodium\n(C) Cadmium\n(D) Caesium\n"}}